{
    "labels":{
        "years":["2021","2020","2019"],
        "index":{
            "psxi": {
                "dataKey": "PSXI",
                "label": "PSXI"
            },
            "impressions": {
                "dataKey": "Impressions",
                "label": "Impressions"
            },
            "sentiments":{
                "dataKey": "Sentiments",
                "label": "Sentiments"
            },
            "interactions":{
                "dataKey": "Interactions",
                "label": "Interactions"
            }
        },
        "groups":{
            "all":{
                "dataKey": "All",
                "label": "All Singaporeans"
            },
            "youth":{
                "dataKey": "Youth",
                "label": "Youth"
            },
            "middle-age":{
                "dataKey": "Middle-Age",
                "label": "Middle Age"
            },
            "seniors":{
                "dataKey": "Seniors",
                "label": "Seniors"
            },
            "pmet":{
                "dataKey": "PMET",
                "label": "PMET"
            },
            "non-pmet":{
                "dataKey": "Non-PMET",
                "label": "Non-PMET"
            }
        
        },
        "agencies":[
            {   "key":"agency-1",
                "name":"MINISTRY OF CULTURE, COMMUNITY AND YOUTH (MCCY)",
                "description":"MCCY's overall PSXI score recorded a significant growth since 2019. This is mainly due to improvements in the Interactions score.",
                "image":"MCCY.png"
            },
            {
                "key":"agency-2",
                "name":"MINISTRY OF DEFENCE (MINDEF)",
                "description":"MINDEF saw a slight increase in its overall PSXI score since 2019. While its Impressions score has remained constant since 2019, its Interactions score improved significantly. It scores relatively lower among Seniors than for other age groups.",
                "image":"MINDEF.png"
            },
            {
                "key":"agency-3",
                "name":"MINISTRY OF EDUCATION (MOE)",
                "description":"MOE's overall PSXI score recorded an important increase since 2019. This can be attributed to a significant increase in the Interactions score. It scored relatively higher among PMETs and middle-age citizens.",
                "image":"MOE.png"
            },
            {
                "key":"agency-4",
                "name":"MINISTRY OF HEALTH (MOH)",
                "description":"MOH recorded an important increase in its overall PSXI score between 2019 and 2020. While its Interactions score increased slightly, there was a significant increase in the Sentiments score.",
                "image":"MOH.png"
            },
            {
                "key":"agency-5",
                "name":"MINISTRY OF HOME AFFAIRS (MHA)",
                "description":"MHA's overall PSXI score slightly increased since 2019. Middle-aged and non-PMET citizens scored it relatively lower than other groups.",
                "image":"MHA.png"
            },
            {
                "key":"agency-6",
                "name":"MINISTRY OF MANPOWER (MOM)",
                "description":"MOM's overall PSXI score has remained virtually unchanged. Its score for Seniors was the lowest across age groups.",
                "image":"MOM.png"
            },
            {
                "key":"agency-7",
                "name":"MINISTRY OF NATIONAL DEVELOPMENT (MND)",
                "description":"MND overall PSXI did not change much since 2019. While its Interactions score is low, middle-aged citizens scored it relatively higher than other age groups.",
                "image":"MND.png"
            },
            {
                "key":"agency-8",
                "name":"MINISTRY OF SOCIAL AND FAMILY DEVELOPMENT (MSF)",
                "description":"MSF's overall PSXI score saw a significant improvement since 2019, mainly driven by the Interactions score. Among all age groups, Youth gave it the highest score.",
                "image":"MSF.png"
            },
            {
                "key":"agency-9",
                "name":"MINISTRY OF THE ENVIRONMENT AND WATER RESOURCES (MEWR)*",
                "description":"Overall, MEWR scored 10.8 points higher than in 2019. This increase was mainly driven by an improvement in the Interactions score.",
                "image":"MEWR.png"
            },
            {
                "key":"agency-10",
                "name":"BUILDING AND CONSTRUCTION AUTHORITY (BCA)",
                "description":"BCA's overall PSXI score saw a slight increase compared to 2019. While its Sentiments score is similar to last year's, the Impressions and Interactions scores have improved.",
                "image":"BCA.png"
            },
            {
                "key":"agency-11",
                "name":"CENTRAL PROVIDENT FUND (CPF)",
                "description":"CPF's overall PSXI score improved significantly since 2019. While its Impressions and Sentiments scores remain close to where they were last year, the Interactions score has significantly increased.",
                "image":"CPF.png"
            },
            {
                "key":"agency-12",
                "name":"HEALTH PROMOTION BOARD (HPB)",
                "description":"HPB is very far along its digitalisation journey, though its 2020 score is lower than in 2019 (76.0).",
                "image":"HPB.png"
            },
            {   
                "key":"agency-13",
                "name":"HOUSING & DEVELOPMENT BOARD (HDB)",
                "description":"HDB's overall PSXI score has not budged much since 2019. Its Impressions and Interactions scores have remained constant, while the Interactions score has slightly dipped.",
                "image":"HDB.png"
            },
            {
                "key":"agency-14",
                "name":"IMMIGRATION AND CHECKPOINTS AUTHORITY (ICA)",
                "description":"ICA's overall PSXI score dropped by 6.3 points compared to 2019, with all dimension scores taking a dip.",
                "image":"ICA.png"
            },
            {
                "key":"agency-15",
                "name":"INLAND REVENUE AUTHORITY OF SINGAPORE (IRAS)",
                "description":"The overall PSXI score for IRAS remains constant in 2020. While its Interactions score has increased, the decrease in the Sentiments score keeps the overall score down.",
                "image":"IRAS.png"
            },
            {
                "key":"agency-16",
                "name":"LAND TRANSPORT AUTHORITY (LTA)",
                "description":"LTA's overall PSXI score has slightly improved in 2020. This is due to a minor increase in its Impressions and Interactions scores. Seniors score LTA relatively lower than other age groups.",
                "image":"LTA.png"
            },
            {
                "key":"agency-17",
                "name":"NATIONAL ENVIRONMENT AGENCY (NEA)",
                "description":"The overall PSXI score for NEA did not see any significant changes between 2019 and 2020. It scores relatively higher among Senior citizens.",
                "image":"NEA.png"
            },
            {
                "key":"agency-18",
                "name":"NATIONAL LIBRARY BOARD (NLB)",
                "description":"The NLB is further along its digitalisation journey in 2020, though its overall PSXI score has seen a 12-point decrease from 2019. This is mainly driven by a steep decrease in its Sentiments score.",
                "image":"NLB.png"
            },
            {
                "key":"agency-19",
                "name":"NATIONAL PARKS BOARD (NPARKS)",
                "description":"NPARKS experienced a 33-point jump from 2019 (35.4). This increase is mainly driven by a significant improvement in its Interactions score.",
                "image":"NParks.png"
            },
            {
                "key":"agency-20",
                "name":"PEOPLE'S ASSOCIATION (PA)",
                "description":"The People's Association saw an important 16.3-point increase in its overall PSXI score. This is largely driven by a significant increase in its Interactions score.",
                "image":"PA.png"
            },
            {
                "key":"agency-21",
                "name":"PUBLIC UTILITIES BOARD (PUB)",
                "description":"The PUB overall PSXI score increased between 2019 and 2020. This was majorly driven by a significant increase in the Interactions score.",
                "image":"PUB.png"
            },
            {
                "key":"agency-22",
                "name":"SINGAPORE LAND AUTHORITY (SLA)",
                "description":"The overall PSXI score for the SLA increased by 13.9 points from 2019, thanks in part to a slight increase in its Interactions score.",
                "image":"SLA.png"
            },
            {
                "key":"agency-23",
                "name":"SKILLSFUTURE SINGAPORE (SSG)",
                "description":"SSG's overall PSXI score remained constant between 2019 and 2020, though there has been a slight decline in the Interactions score.",
                "image":"Skillsfuture.png"
            },
            {
                "key":"agency-24",
                "name":"SPORT SINGAPORE (SportSG)",
                "description":"The PSXI score for SportSG slightly improved from 2019. This was mainly driven by an increase in the Interactions score.",
                "image":"SportSG.png"
            },
            {
                "key":"agency-25",
                "name":"URBAN REDEVELOPMENT AUTHORITY (URA)",
                "description":"The PSXI score for URA improved slightly since 2019. While the URA scored well on Impressions, its Sentiments score remains low compared to other dimensions.",
                "image":"URA.png"
            },
            {
                "key":"agency-26",
                "name":"WORKFORCE SINGAPORE (WSG)",
                "description":"The overall PSXI score for WSG slightly increase compared to 2019. Its Impressions score is high, with Youth scoring it more favourably than other age groups.",
                "image":"WSG.png"
            },
            {
                "key":"agency-27",
                "name":"ACCOUNTING AND CORPORATE REGULATORY AUTHORITY (ACRA)",
                "description":"ACRA's overall PSXI score saw a 15.7-point increase since 2019. This is mainly driven by a significant increase in its Interactions score.",
                "image":"ACRA.png"
            },
            {
                "key":"agency-28",
                "name":"AGRI-FOOD AND VETERINARY AUTHORITY OF SINGAPORE (AVA)*",
                "description":"The PSXI score for AVA has barely moved since 2019. The score for middle-aged citizens is relatively lower than for other age groups.",
                "image":"AVA.png"
            },
            {
                "key":"agency-29",
                "name":"SINGAPORE POLICE FORCE (SPF)",
                "description":"SPF's overall PSXI score saw an 18.1-point increase since 2019. Impressions and Sentiments scores remain constant, but there was a significant increase in the Interactions score.",
                "image":"SPF.png"
            },
            {
                "key":"agency-30",
                "name":"SINGAPORE CIVIL DEFENCE FORCE (SCDF)",
                "description":"SCDF's overall PSXI score saw a 25.3-point increase since 2019. This was mainly driven by improvements in its Interactions score, though it scores lowest among non-PMETs.",
                "image":"SCDF.png"
            }
        ]
    }
}